Hi @wombat,

I wanted to give more explanation regarding the observed behavior.

Here is the code I was using to reproduce the issue:

```hcl
resource "kubernetes_namespace" "namespace" {
  metadata {
    name = "1951"
  }
}

data "kubernetes_namespace" "namespace" {
  metadata {
    name = kubernetes_namespace.namespace.id
  }
}

output "data_namespace" {
  value = data.kubernetes_namespace.namespace.metadata.0.annotations
}

output "namespace_annotations" {
  value = kubernetes_namespace.namespace.metadata.0.annotations
}
```

The first apply produces the following output:

```console
$ terraform apply
Terraform will perform the following actions:

  # data.kubernetes_namespace.namespace will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_namespace" "namespace" {
      + id   = (known after apply)
      + spec = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.namespace will be created
  + resource "kubernetes_namespace" "namespace" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "1951"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

kubernetes_namespace.namespace: Creating...
kubernetes_namespace.namespace: Creation complete after 0s [id=1951]
data.kubernetes_namespace.namespace: Reading...
data.kubernetes_namespace.namespace: Read complete after 1s [id=1951]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

As you can see, it does not say anything about 2 outputs that I have in the code and thus they are not available once the code is applied. This is Terraform behavior, not provider and I do not know why it does not produce any outputs. It seems like Terraform doesn't printout `null` outputs, but in this case it would be expected to see at least the one from data source. I think the Terraform folks can better answer this question.

In the Terraform state file we can see that data source has annotations, resource doesn't:

```json
  "outputs": {},
  "resources": [
    {
      "mode": "data",
      "type": "kubernetes_namespace",
      "name": "namespace",
      "provider": "provider[\"registry.terraform.io/hashicorp/kubernetes\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "id": "1951",
            "metadata": [
              {
                "annotations": {
                  "terraform.io/hello": "world"
                },
...
    {
      "mode": "managed",
      "type": "kubernetes_namespace",
      "name": "namespace",
      "provider": "provider[\"registry.terraform.io/hashicorp/kubernetes\"]",
      "instances": [
        {
          "schema_version": 0,
          "attributes": {
            "id": "1951",
            "metadata": [
              {
                "annotations": null,
```

This is something that Terraform does, not the provider. The provider produces consistent results on every run.

Even if Terraform will print out outputs after the first run, it will remove annotations during the following one, as you can see in your outputs. In this case, `ignore_annotations` won't help(I was wrong in my previous comment). With `ignore_annotations` you won't be able to get ignored annotations. I am not sure how OpenShift handles this situation, whether it is going to add annotations again or it does it only once. But in all cases, Terraform will keep deleting them, since they are not managed by Terraform.

This is not something the provider can address, the observed behavior is fully up to Terraform.